# 印星星：巢狀迴圈遍歷
for m in range(1, 6): # 外層迴圈遍歷 1 到 5
    print(f'm = {m}', end = " ") # 輸出外層變數值且不換行
    for n in range(1, m + 1): # 內層迴圈根據外層數值遍歷
        print(f'n = {n}', end = ' ') # 輸出內層變數值且不換行

    # 內層結束後換行
    print()
print("-" * 122)

# 九九乘法表：巢狀迴圈遍歷
for i in range(1, 10): # 外層迴圈代表乘數 1 到 9
    for j in range(1, 10): # 內層迴圈代表被乘數 1 到 9

        # 格式化輸出乘法結果，使用 \t 進行縮排對齊
        print(f'{i} * {j} = {i * j}', end = '\t')

    # 每完成一列乘法後換行
    print()
print("-" * 122)

# 九九乘法表：直式排列且結果補零
for x in range(1, 10): # 外層迴圈代表乘數 1 到 9
    for y in range(1, 10): # 內層迴圈代表被乘數 1 到 9

        # 格式化輸出：結果為兩位數且不足補 0，並使用 \t 進行縮排對齊
        print(f'{y} * {x} = {x * y:02d}', end = '\t')

    # 每完成一列乘法後換行
    print()